warning_message = "Вы не подписались на канал iTРусалка, подпишитесь: https://t.me/+YVn-tJ0WZ8o5ODY6"

hello_neuro_message = """
Приветики тебе. \n
Я умею почти все! Могу помочь составить резюме, написать за тебя заявления в органы со ссылкам на законы, оказать тебе юридическую поддержку, сочинить стишок на какую-либо тему, написать доклад \n
Написать код на любом языке программирования, помочь разобраться с текущим кодом, составить туристический маршрут по любому городу с пояснениями. 
По сути я умею почти все и каждый день становлюсь только умнее, чтобы помогать простым людям. Представь, что тебе нужна консультация в специфической сфере деятельности \n
Так вот я предоставляю эту консультацию для тебя бесплатно. \n
Если хочешь получить максимальное удовольствие от использования и продуктивные ответы - надо будет научиться правильно задавать мне вопросы. С опытом к тебе это придет.
Пожалуйста составляй точнее свой запрос, можешь подробный ответ у нейросети\n
Ты можешь говорить со мной почти на любые темы \n
Я не принимаю фото и видео, я не работаю с графическими файлами, общение только в текстовом формате. Пиши мне что-нибудь в чат 👇
"""

opportunities = """
🔥 Давай расскажу чем я могу тебе помочь?

1️⃣ Создать резюме. С моей помощью ты можешь устроиться на работу мечты, ведь я могу написать хорошее резюме
2️⃣ Написать текст на любую тему. Это поможет тебе в работе и учебе
3️⃣ Перевести текст с иностранного языка
4️⃣ Ответить на интересующие тебя вопросы. Чаще всего у меня получается это лучше, чем у известных поисковиков
5️⃣ Написать код, перевести его с одного языка на другой и найти ошибки
6️⃣ Планировать и осуществлять расчеты. Например, ты можешь за считанные секунды получить готовый план питания для похудения

💡Это лишь малая часть моего функционала. Задавай мне любые задачи, а я постараюсь тебе помочь.

🔥 Чтобы начать общение, нажми ниже на "💡 Начать диалог"  и напиши мне сообщение  👇🏻
"""

hello_message = """🔥 Давай расскажу чем я могу тебе помочь?

1️⃣ Создать резюме. С моей помощью ты можешь устроиться на работу мечты, ведь я могу написать хорошее резюме
2️⃣ Написать текст на любую тему. Это поможет тебе в работе и учебе
3️⃣ Перевести текст с иностранного языка
4️⃣ Ответить на интересующие тебя вопросы. Чаще всего у меня получается это лучше, чем у известных поисковиков
5️⃣ Написать код, перевести его с одного языка на другой и найти ошибки
6️⃣ Планировать и осуществлять расчеты. Например, ты можешь за считанные секунды получить готовый план питания для похудения

💡Это лишь малая часть моего функционала. Задавай мне любые задачи, а я постараюсь тебе помочь.\n\n"""

hello_message += "Доступные команды для Вас представлены в меню ниже: \n\n"
hello_message += "⚛️ /info - Расскажет о доступных командах бота (выведет это сообщение 🙃) \n\n"
hello_message += "🚸 /profile - Посмотреть профиль\n\n"
hello_message += "↗️ /invite - пригласить друзей\n\n"
hello_message += "👑 /premium - Получить премиум-подписку\n\n"
hello_message += "📚 /neuro - Список нейронок на все случае жизни\n \n \n"
# hello_message += "🔷 Также вы можете узнать актуальный курсы валют, криптовалют для этого необходимо написать код валюты, например usd или /USD или USD. \n "
# hello_message += "Криптовалюты будут по отношению к USDT. \n"
hello_message += "❗ <b>Чтобы начать разговор c нейросетью просто напишите ей что-нибудь в чат, она ждет. 👇🏻 </b> \n"
hello_message += 'Как правильно делать запрос к нейронке, чтобы получить нужный результат? - Смотрите на основном канале iTРусалка в закрепленных сообщениях'

start_dialog = """
Диалог начат. Ты можешь подстраивать меня под себя и придумывать  различные сценарии/правила, которым я буду следовать. Нажми в меню Завершить диалог, чтобы сбросить мою память.
"""

test = """
⚡️Добро пожаловать в лучшего бота нейросетей на всех просторах Telegram!

📌Бот может спокойно общаться с человеком, а его возможности даже сложно описать. 

🦾Если научишься правильно использовать, то он станет твоим лучшим другом и самым незаменимым помощником в жизни. 

❗️Нажми "Запустить" и начинай погружение в мир Искусственного Интеллекта."""

refresh_text = """Диалог начат. Ты можешь подстраивать меня под себя и придумывать  различные сценарии/правила, которым я буду следовать. Нажми в меню Завершить диалог, чтобы сбросить мою память."""


text = """
🤖 Привет, Pavel! Я бот ChatGPT!

🔗 Вы можете задавать любые вопросы

Также бот иногда может грузить ответ в течении нескольких минут. Все зависит от серверов на стороне OpenAI!

Советы к правильному использованию:
– Задавайте осмысленные вопросы, расписывайте детальнее.
– Не пишите ерунду иначе одержите её же в ответ.

Примеры вопросов/запросов:
~ Сколько будет 7 * 8?
~ Когда началась Вторая Мировая?
~ Напиши код калькулятора на Python
~ Напиши сочинение как я провел лето

🔥 Чтобы начать общение, напиши что-нибудь CHATGPT в строку ниже 👇🏻
"""